Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: དགྲ་བཅོམ་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་རིང་དུ་གནས་ལ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་བའི་ཕྱིར་རོ།
en: It is because the arhat remains far removed from the qualities of a buddha, while the bodhisattva will become a blessed buddha.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The bodhisattva great being Sarva­dharmeśvara then said to the Blessed One,

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན་ཉན་ཐོས་ཀྱིས་ནི་ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་མ་ཐོབ་པ་ཉིད་ལགས་སོ།
en: “Blessed One, according to my understanding of the sense of what the Blessed One has taught, the śrāvaka has simply not obtained the qualities of a śrāvaka.”

source: རིགས་ཀྱི་བུ་ཉན་ཐོས་ཀྱིས་ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་མ་ཐོབ་པ་ནི་མ་ཡིན་ཏེ།
en: “Son of a good family, it is not that the śrāvaka has not obtained the qualities of a śrāvaka,

source: འོན་ཀྱང་ཉན་ཐོས་ལ་བྱང་ཆུབ་སེམས་དཔའ་དང་ལྷན་ཅིག་ཏུ་དྲིས་པ་ལ་ལན་གདབ་པའམ།སྤྱོད་པའི་བྱིན་གྱིས་བརླབ་པར་བྱ་བའི་ནུས་པ་དང་མཐུ་ག་ལ་ཡོད།
en: but rather, how could śrāvakas answer questions together with bodhisattvas or have the power and potency to bring about a transformation of their conduct?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Mañjuśrī Kumāra­bhūta said to the Blessed One,

source: །བཅོམ་ལྡན་འདས་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ལགས་ན་བསྟན་པ་འདི་གང་ལ་བསྟན་པ་ལགས།
en: “Blessed One, if the Tathāgata taught that this Śāradvatī­putra was foremost among disciples possessing discriminating wisdom, what did that teaching reveal?”

source: འཇམ་དཔལ་ངས་གང་བསྟན་པ་འདི་ནི་བསྟན་པ་མེད་པའོ།
en: “Mañjuśrī, what I taught was without teaching.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then Mañjuśrī Kumāra­bhūta said to the elder Śāradvatī­putra,

source: །གནས་བརྟན་གྱིས་ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་ཐོབ་བམ།
en: “Elder, did you obtain the qualities of a śrāvaka?”

source: སྨྲས་པ་དེ་ནི་མ་ཡིན་ནོ།
en: He answered, “No, I did not.”

source: འོ་ན་ཅི་ཁྱོད་སོ་སོའི་སྐྱེ་བོའམ། སྨྲས་པ་དེ་ནི་མ་ཡིན་ནོ། །
en: “In that case, are you an ordinary person?” “No.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། འོ་ན་ཅི་ཁྱོད་སློབ་བའམ། སྨྲས་པ་དེ་ནི་མ་ཡིན་ནོ། །
en: “So, are you a trainee?” “No.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། འོ་ན་ཁྱོད་ཅི་ཤེས་རབ་དང་ལྡན་པའི་མཆོག་ཡིན་ནམ།སྨྲས་པ་དེ་ནི་མ་ཡིན་ནོ།
en: “Are you foremost among those who possess discriminating wisdom?” “No.”

source: གལ་ཏེ་བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སོ་སོའི་སྐྱེ་བོ་ཡང་མ་ཡིན། སློབ་པ་ཡང་མ་ཡིན། ཤེས་རབ་དང་ལྡན་པའི་མཆོག་ཀྱང་མ་ཡིན་ན་དེ་ཉིད་ཁྱོད་དམིགས་པ་ཅན་དུ་འགྱུར་རོ།
en: “Honorable Śāradvatī­putra, if you are neither an ordinary person nor a trainee, nor foremost among those possessing discriminating wisdom, that can only mean you are someone who adheres to a heretical view.”

source: །ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ།
en: Śāradvatī­putra said,

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་སྐྱེས་བུ་དམ་པ་རྒྱ་མཚོ་ལྟར་གཏིང་དཔག་དཀའ་བ་ཁྱོད་དང་འགྱེད་པར་མི་བྱེད་དོ།
en: “Son of a good family, I am not going to debate with you, a sublime person whose profound depth is as unfathomable as the ocean.”

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ནི་རྒན་རབས་ཐུ་བོ་མཆོག་ཡིན་གྱིས་བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་སྐད་མ་ཟེར་ཅིག
en: “Honorable Śāradvatī­putra, do not say that! You are the most prominent of the older generation.”

source: །གནས་བརྟན་གྱིས་སྨྲས་པ།
en: The elder said,

source: རིགས་ཀྱི་བུ་རྒས་པའི་དངོས་པོས་ནི་ཅི་ཡང་འཐོབ་པར་མི་འགྱུར། མངོན་པར་རྟོགས་པར་མི་འགྱུར་རོ།
en: “The fact of my age will not itself achieve anything, nor will it lead to realization.

source: །རིགས་ཀྱི་བུ་དོན་དེ་ཉིད་ཤེས་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་དཔེ་བྱའོ།
en: To make it better understood, son of a good family, I will give you an analogy.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྡོ་རྗེ་ངན་ངོན་གྱིས་ཀྱང་རི་བྲག་ཆེན་པོ་རྣམ་པར་འཇིག་གོ།
en: Consider how with a small diamond even a great boulder may be destroyed.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ཁྱོད་ཀྱི་སྤུའི་ཁུང་བུ་གཅིག་ན་ཤེས་རབ་འདུག་པ་གང་ཡིན་པ་དེ་ནི་ཁོ་བོ་ལྟ་བུའི་སེམས་ཅན་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་རྣམས་ལ་མེད་དོ།
en: Likewise, the discriminating wisdom that you have in a single pore of your body is more than a sentient being like myself has in all the particles of my body put together.

source: །རིགས་ཀྱི་བུ་དོན་དེ་ཉིད་ཤེས་པར་བྱ་བའི་ཕྱིར་ཡང་ཁྱོད་ལ་དཔེ་བྱའོ།
en: Son of a good family, to make it understood, I will use another analogy for you.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: It is like, for instance,

source: བ་ལང་གླང་པོ་ཆེ་ཤིན་ཏུ་མི་བཟད་པ་ཆེན་པོ་དེ་ཡང་མི་སྟོབས་དང་ལྡན་པས་ལྕགས་ཀྱུ་ཆུང་དུས་དུལ་བར་བྱེད་དོ།
en: how a powerful man can, with just a small iron hook, tame a huge frightful elephant.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ཁྱོད་ནི་སྟོབས་དང་ལྡན་པ།
en: Son of good family, likewise, you possess power.

source: ཁོ་བོ་ནི་ཉམ་ཆུང་བ་སྟེ།
en: I am weak.

source: གླང་པོ་ཆེ་ཆེན་པོ་འདི་ལྟ་བུ་དང་ཁོ་བོ་འགྱེད་ག་ལ་ནུས།
en: How can I debate with a great elephant like this?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the elder Śāradvatī­putra said to the Blessed One,

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: “Blessed One, it is like this:

source: དཔེར་ན་མི་དམུས་ལོང་གིས་ཤུལ་དུ་མཆི་བའམ། གྲོང་ཁྱེར་མཐོང་བར་ཡང་རྔོ་མི་ཐོགས་ན་ཁྱིམ་ནས་ཁྱིམ་དུ་མཆི་བའི་རྔོ་ལྟ་ག་ལ་ཐོགས་ཏེ།
en: if a blind man cannot follow after someone or see a city, how would he manage to go from house to house?

source: དེ་ནི་གནས་མ་མཆིས་སོ།
en: That would be impossible.

source: །དེ་བཞིན་དུ་གླང་པོ་ཆེ་ཆེན་པོ་ལྟ་བུ་འདི་དག་གི་མདུན་ན་བདག་ནི་དམུས་ལོང་དང་མཚུངས་པར་མཐོང་སྟེ།
en: Similarly, I see myself as blind in the presence of great elephants like these.

source: སངས་རྒྱས་ཀྱི་ཆོས་འདི་དག་ནི་དེ་ཙམ་དུ་རྒྱ་ཆེ་བ་ལགས་སོ།
en: The qualities of a buddha are that vast.

source: །བདག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་དུ་མ་གྱུར་ཏེ།
en: I am not a suitable vessel for the qualities of a buddha.

source: ད་ཅི་བགྱིར་ཡང་མ་མཆིས་སོ།
en: Now there is nothing for me to do.”

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་སྐད་མ་ཟེར་ཅིག
en: “Śāradvatī­putra, do not talk like that!

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱིས་སེམས་ཅན་ཇི་སྙེད་ཅིག་ལ་རེག་པ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཐོབ་པ་ཡིན་ནོ།
en: Consider, for example, that however many sentient beings may be touched by light from a tathāgata, all will obtain the qualities of a buddha.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཁྱོད་ནི་ཏིང་ངེ་འཛིན་མཐའ་ཡས་ཤིང་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པ་ཡིན་ནོ།
en: Likewise, Śāradvatī­putra, you will be a recipient of limitless and inconceivable meditative absorptions.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན།
en: When the Blessed One explained this Dharma discourse,

source: ལྷ་དང་མིའི་སྐྱེ་དགུ་ལས་སེམས་ཅན་དགུ་ཁྲི་ཉིས་སྟོང་གིས་ཆོས་མངོན་པར་རྟོགས་པར་གྱུར་ཏོ།
en: ninety-two thousand among the gods and humans gained a clear understanding of the Dharma.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དཀོན་མཆོག་ཏ་ལ་ལ་སྦྱོར་བ་མཐའ་ཡས་པ་ཞེས་བྱ་བ་དེ་ལ་སྙོམས་པར་ཞུགས་སོ།
en: It was at this point that the bodhisattva Dharma­mati entered the bodhisattva’s meditative absorption called the infinite application of the jewel torch.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་ཕ་རོལ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱིས་ཞལ་མངོན་པར་བསྟན་ཏེ།
en: No sooner had the bodhisattva Dharma­mati entered that meditative absorption than, from the world systems in each of the ten directions that exceed in number the atoms of ten thousand buddhafields, blessed buddhas numbering as many as the atoms of ten thousand buddhafields showed their faces.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་མཚན་རྡོ་རྗེའི་སྙིང་པོ་ཞེས་བྱ་བར་འཐུན་པ་ཤ་སྟག་གོ།
en: Those blessed buddhas all had but one and the very same name: Vajra Quintessence.

source: །ཕྱོགས་གཅིག་ཇི་ལྟ་བར་ཕྱོགས་བཅུ་རྣམས་ནས་ཀྱང་དེ་བཞིན་ཏེ།
en: As though they were in just one place despite issuing from the ten directions,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: those blessed buddhas said to him,

source: །ཆོས་ཀྱི་བློ་གྲོས་ཁྱོད་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སྦྱོར་བ་མཐའ་ཡས་པ་ལ་སྙོམས་པར་ཞུགས་པ་ལེགས་སོ་ལེགས་སོ།
en: “Dharma­mati, that you have entered the bodhisattva’s meditative absorption of the infinite application in this way is excellent, excellent!

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: Son of a good family, it is like this.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་འདི་ཉིད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་དང་། སྔོན་གྱི་བྱིན་གྱི་རླབས་དང་། ཁྱོད་ཉིད་ཀྱི་དགེ་བའི་རྩ་བས་ཉེ་བར་བརྟན་པས་འདི་ལྟ་སྟེ་ཆོས་ཐམས་ཅད་བསྟན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རྣམ་པར་སྦྱང་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རྣམ་པར་འཕེལ་བར་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་སུ་འཇུག་པར་བྱ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་རྣམ་པར་དགྲོལ་བ་དང་། ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་འཇུག་ཅིང་ཆུད་པར་བྱ་བ་དང་། ཀུན་དུ་སྦྱོར་བར་བྱ་བ་དང་། སྐད་ཐམས་ཅད་བརྗོད་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་འཇུག་པར་བྱ་བ་དང་། ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པར་བྱ་བ་དང་། དུས་གསུམ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པའི་ཆོས་བསྟན་པ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཕྱོགས་བཅུ་ནས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཐམས་ཅད་ཀྱང་མཚན་འཐུན་པར་འདི་དག་ཐམས་ཅད་ཁྱོད་ལ་བྱིན་གྱིས་རློབ་ཀྱིས་རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: Through the previous aspirations and previous blessings of this blessed tathāgata Vairocana himself, and reinforced by your own roots of virtue, all we buddhas from the ten directions, numbering as many as the atoms of ten thousand buddhafields and each one with the same name, bless you, so that you may teach all Dharma teachings, purify the gnosis of buddhahood, increase the gnosis of buddhahood, enter into the dharmadhātu, liberate the realms of sentient beings, enter and penetrate unbound gnosis, engage with gnosis, speak all languages, enter into omniscient gnosis, become unobstructed with respect to all phenomena, and engage in teaching the Dharma through knowing all three times.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་བཅུ་ལས་བརྩམས་ཏེ། སངས་རྒྱས་ཀྱི་མཐུ་དང་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཆོས་བསྟན་པ་འདི་ལ་སྤོབས་པ་སྐྱེད་ཅིག །
en: Through the strength and blessing of the Buddha, expound the Dharma with inspired speech, beginning with the ten categories of the bodhisattva!”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ལ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་དང་། སྒྲིབ་པ་མེད་པ་དང་། ཆོད་པ་མེད་པ་དང་། བརྗེད་པ་མེད་པའི་ཆོས་ཉིད་དང་། ཐ་དད་པ་མེད་པའི་ཡེ་ཤེས་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་ཟིལ་གྱིས་མི་ནོན་པ་དང་། ཞུམ་པ་མེད་པ་དང་། འཕྲོགས་པ་མེད་པའི་ཆོས་ཉིད་དང་། བརྗོད་པ་བཟང་པོ་ཉེ་བར་སྒྲུབ་པ་མཛད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Then those blessed buddhas caused that blessed bodhisattva Dharma­mati to attain the light of unimpeded gnosis, with a very nature that was free of obstruction, free of interruption, and not forgetful; a gnosis free from differentiation, with a very nature that was morally blameless, inviolable, dauntless, inalienable; and excellent speech. Why so?

source: འདི་ལྟར་ཏིང་ངེ་འཛིན་འདི་ཉིད་ཀྱི་ཆོས་ཉིད་ཐོབ་པའི་ཕྱིར་རོ།
en: Because he had thus obtained the very nature of that absorption.

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱི་མགོ་ལ་ཉུག་པ་མཛད་དེ།
en: Then those blessed buddhas extended their right hands and touched the head of the bodhisattva Dharma­mati.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ལ་རེག་མ་ཐག་ཏུ། དེ་ནས་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་སྨྲས་པ།
en: As soon as those blessed buddhas had touched the bodhisattva Dharma­mati, he rose from that absorption and said to the bodhisattvas,

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རིགས་འདི་ནི་འདི་ལྟ་སྟེ། ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ་དང་། ནམ་མཁའི་ཁམས་ཀྱི་མཐས་གཏུགས་པས་རྒྱ་ཆེ་བའོ།།
en: “O sons of the victors, this family of bodhisattvas is as follows: it is vast owing to the boundlessness of the dharmadhātu and of the element of space.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རིགས་སུ་སྐྱེ་བ་ཡིན། མ་བྱོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རིགས་སུ་སྐྱེ་བ་ཡིན། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རིགས་སུ་སྐྱེ་བ་ཡིན་ནོ།།
en: O sons of the victors, the bodhisattva great beings were born into the family of past blessed buddhas, future blessed buddhas, and present blessed buddhas.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then those bodhisattvas said to the bodhisattva Dharma­mati,

source: ཀྱེ་རྒྱལ་བའི་སྲས་གང་དག་འདས་པ་དང་།མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རིགས་སུ་སྐྱེ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་གང་ཡིན།
en: “O son of the victors, who are those bodhisattva great beings who were born into the family of the past, future, and present blessed buddhas?

source: གང་ལས་བསམས་ཏེ་དེ་སྐད་སྨྲ།
en: Tell me what thought they came from.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་བཅུ་པོ་དེ་དག་གང་ཡིན་པ་དེ་ཤོད་ཅིག །
en: O son of the victors, explain what those ten categories of bodhisattvas are!”

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The bodhisattva Dharma­mati said to those bodhisattvas,

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་ནི་བཅུ་པོ་འདི་དག་སྟེ། དེ་དག་ནི་འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་སོ། །གསུང་ངོ་། །གསུང་བར་འགྱུར་རོ།
en: “O sons of the victors, ten categories of bodhisattvas were taught, are taught, and will be taught by buddhas of the past, present, and future.

source: །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those ten? They are:

source: སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་དང་། ལས་དང་པོ་པ་དང་། རྣལ་འབྱོར་སྤྱོད་པ་དང་། སྐྱེ་བར་སྐྱེས་པ་དང་། སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་དང་། བསམ་པ་ཕུན་སུམ་ཚོགས་པ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་གཞོན་ནུར་གྱུར་པ་དང་རྒྱལ་ཚབ་དང་། དབང་བསྒྱུར་བ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: (1) bodhisattvas who have generated the initial thought of awakening, (2) beginners, (3) those who engage in yogic practice, (4) those who have taken rebirth, (5) those who have perfected application, (6) those who have perfected intention, (7) those who are irreversible, (8) those who are still youths, (9) those who are regents, and (10) those who have been consecrated.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་ནི་བཅུ་པོ་དེ་དག་སྟེ། དེ་དག་ནི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་སོ། །གསུང་ངོ་། །གསུང་པར་འགྱུར་རོ།
en: O sons of the victors, those ten categories of bodhisattvas were taught, are taught, and will be taught by buddhas of the past, present, and future.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: (1) “O sons of the victors, what is the category of bodhisattvas who have generated the initial thought of awakening?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་མ་ཐག་ཏུ་གཟུགས་བཟང་བའམ། མཛེས་པའམ། ཁ་དོག་བཟང་པོ་རྒྱས་པའམ། རྒྱ་ཆེ་བའམ། གཟི་བརྗིད་ཆེ་བའམ། རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པའམ། ཀུན་རྗོད་པའི་རྣམ་པར་འཕྲུལ་པའམ། རྗེས་སུ་བསྟན་པའི་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངམ། སེམས་ཅན་སྡུག་བསྔལ་བ་དག་མཐོང་ངམ། དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་རྒྱ་ཆེར་ཐོས་ན་འདི་ལྟ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འདོད་ཅིང་ཐོག་མ་ཉིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: O sons of the victors, these bodhisattvas who have generated the initial thought of awakening will, as soon as they see the blessed buddhas, see an excellent or beautiful form with a completely excellent and brilliant complexion, miracles of magical displays, miracles of mind reading, or miracles of insightful admonition, or see suffering sentient beings, or hear the praises of the Tathāgata, such that they will long for all-knowing gnosis and from the very beginning generate the intention to attain the highest insuperable awakening.

source: །སེམས་བསྐྱེད་མ་ཐག་པ་དེ་ཉིད་ཀྱིས་བསྙེན་པར་དཀའ་བའི་གནས་བཅུ་ཡོངས་སུ་བཟུང་བར་འགྱུར་ཏེ།
en: And as soon as that very first intention to attain awakening is generated, those beings will have taken up ten things that are difficult to approach.

source: བཅུ་གང་ཞེ་ན།
en: What are those ten? They are:

source: འདི་ལྟ་སྟེང་གནས་དང་གནས་མ་ཡིན་པ་ཤེས་པ་དང་། འདས་པ་དང་། མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་ལས་དང་ཆོས་ཡང་དག་པར་བླངས་པ་ཤེས་པ་དང་། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་དང་། ཁམས་དུ་མ་སྣ་ཚོགས་ཤེས་པ་དང་། མོས་པ་དང་རྣམ་པར་གྲོལ་བ་དུ་མ་ཤེས་པ་དང་། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་ལྡང་བ་ཐམས་ཅད་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་དང་། ལྷའི་མིག་གི་ཤེས་པ་དང་། ཟག་པ་ཟད་པ་ཤེས་པ་སྟེ།
en: (1) the knowledge of what is possible and impossible, (2) the knowledge of deeds that occur in the past, present, and future and qualities that were obtained, (3) the knowledge of everywhere that paths lead, (4) the knowledge of the numerous and varied constituents of beings, (5) the knowledge of numerous spiritual inclinations and liberations, (6) the knowledge of the superior and inferior faculties, (7) the knowledge of the meditative concentrations, emancipations, absorptions, and meditative attainments in their defiled and purified forms and their arising, (8) the knowledge that remembers previous lives, (9) the knowledge of the divine eye, and (10) the knowledge of the exhaustion of defilements.

source: བསྙེན་པར་དཀའ་བའི་གནས་བཅུ་པོ་དེ་དག་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ།
en: Thus, they will have taken up those ten things that are difficult to approach.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: O sons of the victors, such is the category of bodhisattvas who have generated the initial thought of awakening.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སངས་རྒྱས་མཆོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བདེ་བའི་ཡོ་བྱད་ལ་སྦྱར་བར་བྱའོ།
en: “O sons of the victors, these bodhisattva great beings who have generated the initial thought of awakening should worship the Buddha and apply the requisites for a bodhisattva’s happiness.

source: །དེ་ལ་འཇིག་རྟེན་གྱི་བདག་པོར་འགྱུར་བ་དང་། མཆོག་ཏུ་བྱ་བ་དང་ཟིལ་གྱིས་མི་གནོན་པ་དང་། སངས་རྒྱས་དཔག་ཏུ་མེད་པ་དང་ཕྲད་པ་དང་། རབ་ཏུ་ཞི་བའི་ཏིང་ངེ་འཛིན་ལ་རྣལ་འབྱོར་དུ་བྱ་བ་དང་། འཁོར་བའི་འཁོར་ལོ་རྣམ་པར་བཟློག་པ་དང་། དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དང་། སེམས་ཅན་སྡུག་བསྔལ་བ་ཡོངས་སུ་བསྐྱབ་པ་ཡང་བརྗོད་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Concerning that, they should provide explanations on becoming the lord of the world, acting sublimely, not being outshone, meeting with an immeasurable number of buddhas, engaging in yogic practice in the absorption of complete pacification, turning back the wheel of saṃsāra, setting in motion the wheel of the holy Dharma, and protecting suffering sentient beings. Why so?

source: འདི་ལྟར་སེམས་བསྐྱེད་མ་ཐག་པ་དེ་ཉིད་ཀྱིས་ཤས་ཆེར་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སྦྱོར་ཞིང་གོང་དུ་གནས་གང་དག་ཐོས་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི། གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: It is because upon generating the thought of awakening, they apply themselves for the most part to all the qualities of a buddha, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།
en: O sons of the victors, such is the category of bodhisattvas who have generated the initial thought of awakening. (2)

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: “O sons of the victors, what is the category of beginner bodhisattvas?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་རྣམས་ལ་ཐོག་མ་ཉིད་དུ་སེམས་རྣམ་པ་བཅུ་བསྐྱེད་དེ།
en: O sons of the victors, these beginner bodhisattvas have from the start generated ten aspects of mind.

source: རྣམ་པ་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the ten aspects? They are:

source: ཕན་པར་བྱ་བའི་སེམས་དང་བདེ་བར་བྱ་བའི་སེམས་དང་། སྙིང་བརྩེ་བའི་སེམས་དང་། མཉེན་པའི་སེམས་དང་། སྡུག་པའི་སེམས་དང་། ཕན་གདགས་པའི་སེམས་དང་། ཀུན་དུ་བསྲུང་བའི་སེམས་དང་། སྙོམས་པའི་སེམས་དང་། སློབ་དཔོན་གྱི་སེམས་དང་། སྟོན་པའི་སེམས་ཏེ།
en: (1) a mind that brings benefit, (2) a mind that brings happiness, (3) a mind of kindness, (4) a mind that is flexible, (5) a mind that feels sadness, (6) a mind that intends to help, (7) a mind that aims at protecting everyone, (8) a mind of equality, (9) a mind of becoming a teacher, (10) and a mind of becoming a great teacher.

source: སེམས་རྣམ་པ་བཅུ་པོ་འདི་དག་བསྐྱེད་དོ།
en: They have generated these ten aspects of mind.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའོ།
en: O sons of the victors, such are beginner bodhisattvas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལུང་མནོད་པ་དང་། ཁ་ཏོན་ལ་སྦྱར་བར་བྱའོ།
en: “O sons of the victors, such beginner bodhisattvas should apply themselves to receiving instructions on scriptures and recitation.

source: །མང་དུ་ཐོས་ནས་རབ་ཏུ་དབེན་པ་ལ་སྦྱར་བར་བྱའོ།
en: After becoming learned, they should devote themselves to retiring into solitude.

source: །རབ་ཏུ་དབེན་པར་གྱུར་ནས་དགེ་བའི་བཤེས་གཉེན་ལ་མངོན་པར་དགའ་བ་ལ་སྦྱར་བར་བྱའོ།
en: Having retired into solitude, they should devote themselves to pleasing their spiritual teachers.

source: །དགེ་བའི་བཤེས་གཉེན་ལ་མངོན་པར་དགའ་ནས་བཀའ་བློ་བདེ་བ་ལ་སྦྱར་བར་བྱའོ།
en: Having pleased their teachers, they should devote themselves to delighting in following their instructions.

source: །བཀའ་བློ་བདེ་བར་གྱུར་ནས་དུས་ཤེས་པ་ལ་སྦྱར་བར་བྱའོ། །
en: Having followed their instructions with delight, they should devote themselves to awareness of temporality.

source: དུས་ཤེས་པར་གྱུར་ནས་མི་འཇིགས་པ་ལ་སྦྱར་བར་བྱའོ།
en: Having become aware of temporality, they should devote themselves to fearlessness.

source: །མི་འཇིགས་པར་གྱུར་ནས་དོན་ཤེས་པ་ལ་སྦྱར་བར་བྱའོ།
en: Having become fearless, they should devote themselves to knowing the meaning.

source: །དོན་ཤེས་པར་གྱུར་ནས་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་ལ་སྦྱར་བར་བྱའོ།
en: Having become knowledgeable in the meaning, they should devote themselves to following the Dharma.

source: །ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བར་གྱུར་ནས་བརྗེད་པ་མེད་པའི་ཆོས་ཉིད་ལ་སྦྱར་བར་བྱའོ། །རྨོངས་པ་མེད་པར་གྱུར་ནས་ཆོས་རྣམ་པར་དགོད་པ་ལ་སྦྱར་བར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Having become a follower of Dharma, they should apply themselves to the nature of non-confusion. Having become free of confusion, they should apply themselves to formulating the Dharma. Why so?

source: འདི་ལྟར་སེམས་བསྐྱེད་མ་ཐག་པ་དེ་ཉིད་ཀྱིས་ཤས་ཆེར་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་བརྩོན་པར་བྱེད་ཅིང་གོང་དུ་གནས་གང་དག་ཐོབ་པའི་གནས་དེ་དག་ལ་ཡང་བདག་ཉིད་སྦྱོར་གྱི་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: Because upon first generating the thought of awakening, for the most part they apply themselves with diligence to all the teachings of the Buddha, and those subjects of learning acquired previously are mastered with their own application and without recourse to dependence on others.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པའོ།།
en: O sons of the victors, such is the category of beginner bodhisattvas.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་ལ་རྣལ་འབྱོར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གཞག་པ་གང་ཞེ་ན།
en: (3) “O sons of the victors, what is the category of bodhisattvas who engage in yogic practice?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལ་རྣལ་འབྱོར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དམིགས་པ་རྣམ་པ་བཅུས་ཆོས་རྣམས་རྟོགས་པར་བྱེད་དེ།
en: O sons of the victors, concerning this, bodhisattvas who engage in yogic practice will understand entities by means of ten aspects of apprehending.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those ten? They are:
